RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_pwr.h
}
#endif /* PWR_CR3_UCPD_STDBY */

#if defined(PWR_CR3_UCPD_DBDIS)
/**
  * @brief  Enable (write 0) USB Type-C dead battery pull-down behavior
  * on UCPD1_CC1 and UCPD1_CC2 pins.
  * @note After exiting reset, the USB Type-C ¡°dead battery¡± behavior will be enabled,
  * which may have a pull-down effect on CC1 and CC2 pins. It is recommended to disable it
  * in all cases, either to stop this pull-down or to hand over control to the UCPD1
  * (which should therefore be initialized before doing the disable).
  * @rmtoll CR3          PWR_CR3_UCPD_DBDIS           LL_PWR_EnableUSBDeadBattery
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBDeadBattery(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_UCPD_DBDIS);
}

/**
  * @brief  Disable (write 1) USB Type-C dead battery pull-down behavior
  *  on UCPD1_CC1 and UCPD1_CC2 pins.
  * @note After exiting reset, the USB Type-C ¡°dead battery¡± behavior will be enabled,
  * which may have a pull-down effect on CC1 and CC2 pins. It is recommended to disable it
  * in all cases, either to stop this pull-down or to hand over control to the UCPD1
  * (which should therefore be initialized before doing the disable).
  * @rmtoll CR3          PWR_CR3_UCPD_DBDIS           LL_PWR_DisableUSBDeadBattery
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBDeadBattery(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_UCPD_DBDIS);
}

/**
  * @brief  Check USB Type-C dead battery pull-down behavior
  *         on UCPD1_CC1 and UCPD1_CC2 pins.
  * @note After exiting reset, the USB Type-C ¡°dead battery¡± behavior will be enabled,
  * which may have a pull-down effect on CC1 and CC2 pins. It is recommended to disable it
  * in all cases, either to stop this pull-down or to hand over control to the UCPD1
  * (which should therefore be initialized before doing the disable).
  * @rmtoll CR3          PWR_CR3_UCPD_DBDIS           LL_PWR_IsEnabledUSBDeadBattery
  * @retval State of bit.
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBDeadBattery(void)
{

  return ((READ_BIT(PWR->CR3, PWR_CR3_UCPD_DBDIS) == (PWR_CR3_UCPD_DBDIS))?1UL:0UL);

}
#endif /* PWR_CR3_UCPD_DBDIS */

#if defined(PWR_CR2_USV)
/**
  * @brief  Enable VDDUSB supply
  * @rmtoll CR2          USV           LL_PWR_EnableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddUSB(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_USV);
}

/**
  * @brief  Disable VDDUSB supply
  * @rmtoll CR2          USV           LL_PWR_DisableVddUSB
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddUSB(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_USV);
}

/**
  * @brief  Check if VDDUSB supply is enabled
  * @rmtoll CR2          USV           LL_PWR_IsEnabledVddUSB
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddUSB(void)
{
  uint32_t temp;
  temp = READ_BIT(PWR->CR2, PWR_CR2_USV);

  return ((temp == (PWR_CR2_USV))?1U:0U);

}
#endif

#if defined(PWR_CR2_IOSV)
/**
  * @brief  Enable VDDIO2 supply
  * @rmtoll CR2          IOSV          LL_PWR_EnableVddIO2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableVddIO2(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_IOSV);
}

/**
  * @brief  Disable VDDIO2 supply
  * @rmtoll CR2          IOSV          LL_PWR_DisableVddIO2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableVddIO2(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_IOSV);
}

/**
  * @brief  Check if VDDIO2 supply is enabled
  * @rmtoll CR2          IOSV          LL_PWR_IsEnabledVddIO2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledVddIO2(void)
{
  uint32_t temp;
  temp = READ_BIT(PWR->CR2, PWR_CR2_IOSV);

  return ((temp == (PWR_CR2_IOSV))?1U:0U);

}
#endif

/**
  * @brief  Enable the Power Voltage Monitoring on a peripheral
  * @rmtoll CR2          PVME1         LL_PWR_EnablePVM\n
  *         CR2          PVME2         LL_PWR_EnablePVM\n
  *         CR2          PVME3         LL_PWR_EnablePVM\n
  *         CR2          PVME4         LL_PWR_EnablePVM
  * @param  PeriphVoltage This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVM_VDDA_COMP     (*)
  *         @arg @ref LL_PWR_PVM_VDDA_FASTDAC  (*)
  *         @arg @ref LL_PWR_PVM_VDDA_ADC
  *         @arg @ref LL_PWR_PVM_VDDA_OPAMP_DAC
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVM(uint32_t PeriphVoltage)
{
  SET_BIT(PWR->CR2, PeriphVoltage);
}

/**
  * @brief  Disable the Power Voltage Monitoring on a peripheral
  * @rmtoll CR2          PVME1         LL_PWR_DisablePVM\n
  *         CR2          PVME2         LL_PWR_DisablePVM\n
  *         CR2          PVME3         LL_PWR_DisablePVM\n
  *         CR2          PVME4         LL_PWR_DisablePVM
  * @param  PeriphVoltage This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVM_VDDA_COMP     (*)
  *         @arg @ref LL_PWR_PVM_VDDA_FASTDAC  (*)
  *         @arg @ref LL_PWR_PVM_VDDA_ADC
  *         @arg @ref LL_PWR_PVM_VDDA_OPAMP_DAC
  *
  *         (*) value not defined in all devices
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVM(uint32_t PeriphVoltage)
{
  CLEAR_BIT(PWR->CR2, PeriphVoltage);
}

/**
  * @brief  Check if Power Voltage Monitoring is enabled on a peripheral
  * @rmtoll CR2          PVME1         LL_PWR_IsEnabledPVM\n
  *         CR2          PVME2         LL_PWR_IsEnabledPVM\n
  *         CR2          PVME3         LL_PWR_IsEnabledPVM\n
  *         CR2          PVME4         LL_PWR_IsEnabledPVM
  * @param  PeriphVoltage This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVM_VDDA_COMP     (*)
  *         @arg @ref LL_PWR_PVM_VDDA_FASTDAC  (*)
  *         @arg @ref LL_PWR_PVM_VDDA_ADC
  *         @arg @ref LL_PWR_PVM_VDDA_OPAMP_DAC
  *
  *         (*) value not defined in all devices
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVM(uint32_t PeriphVoltage)
{
  uint32_t temp;
  temp = READ_BIT(PWR->CR2, PeriphVoltage);

  return ((temp == (PeriphVoltage))?1U:0U);

